<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'เกี่ยวกับความเป็นมาสาขาวิชาการจัดการเทคโนโลยีสารสนเทศ';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <p>
      <div class="container-fluid">
          <div class ="col-md-11 col-md-offset-0">
              <p align="justify" style="text-indent: 1in">สาขาวิชาการจัดการเทคโนโลยีสารสนเทศ
 	ความก้าวหน้าทางด้านวิทยาศาสตร์และเทคโนโลยีทำให้มีการพัฒนาคิดค้นสิ่งอำนวยความสะดวก สบายต่อการดำชีวิตเป็นอันมาก เทคโนโลยีได้เข้ามาเสริมปัจจัยพื้นฐานการดำรงชีวิตได้เป็นอย่างดีเทคโนโลยีทำให้การสร้างที่พักอาศัยมีคุณภาพมาตรฐานสามารถผลิตสินค้าและให้บริการต่างๆเพื่อตอบสนองความต้อง การของมนุษย์มากขึ้น เทคโนโลยีทำให้ระบบการผลิตสามารถผลิตสินค้าได้เป็นจำนวนมากมีราคาถูกลง สินค้าได้คุณภาพ เทคโนโลยีทำให้มีการติดต่อสื่อสารกันได้สะดวก การเดินทางเชื่อมโยงถึงกันทำให้ประชากรในโลกติดต่อรับฟังข่าวสารกันได้ตลอดเวลา
 	พัฒนาการของเทคโนโลยีทำให้ชีวิตความเป็นอยู่เปลี่ยนไปมากลองย้อนไปในอดีตโลกมีกำเนินมาประ มาณ 4600 ล้านปี เชื่อกันว่าพัฒนาการตามธรรมชาติทำให้เกิดสิ่งมีชีวิตถือกำเนินบนโลกประมาณ 500 ล้านปีที่แล้ว ยุคไดโนเสาร์มีอายุอยู่ในช่วง 200 ล้านปี สิ่งมีชีวิตที่เป็นเผ่าพันธุ์มนุษย์ ค่อย ๆ พัฒนามา คาดคะเนว่าเมื่อห้าแสนปีที่แล้วมนุษย์สามารถส่งสัญญาณท่าทางสื่อสารระหว่างกันและพัฒนามาเป็นภาษา มนุษย์สามารถสร้างตัวหนังสือ และจารึกไว้ตามผนึกถ้ำ เมื่อประมาณ 5000 ปีที่แล้ว กล่าวได้ว่ามนุษย์ต้องใช้เวลานานพอสมควรในการพัฒนาตัวหนังสือที่ใช้แทนภาษาพูด และจากหลักฐานทางประวัติศาสตร์พบว่า มนุษย์สามารถจัดพิมพ์หนังสือได้เมื่อประมาณ 5000 ปีที่แล้ว กล่าวได้ว่าฐานทางประวัติศาสตร์พบว่า มนุษย์สามารถจัดพิมพ์หนังสือได้เมื่อประมาณ 500 ถึง 800 ปีที่แล้ว
 	เทคโนโลยีเริ่มเข้ามาช่วยในการพิมพ์ ทำให้การสื่อสารด้วยข้อความและภาษาเพิ่มขึ้นมาก เทคโนโลยีพัฒนามาจนถึงการสื่อสารกัน โดยส่งข้อความเป็นเสียงทางสายโทรศัพท์ได้ประมาณร้อยกว่าปีที่แล้ว และเมื่อประมาณห้าสิบปีที่แล้ว ก็มีการส่งภาพโทรทัศน์และคอมพิวเตอร์ทำให้มีการใช้สารสนเทศในรูปแบบข่าวสารมากขึ้น ในปัจจุบันมีสถานที่วิทยุ โทรทัศน์ หนังสือพิมพ์ แ ละสื่อต่าง ๆ ที่ใช้ในการกระจ่ายข่าวสาร มีการแพร่ภาพทางโทรทัศน์ผ่านดาวเทียมเพื่อรายงานเหตุการณ์สด เห็นได้ชัดว่าเทคโนโลยีได้เข้ามามีบทบาทอย่างมาก

  <p align="justify" style="text-indent: 1in">บทบาทของการพัฒนาเทคโนโลยีรวดเร็วขึ้นเมื่อมีการพัฒนาอุปกรณ์ทางด้านคอมพิวเตอร์และส่วนประกอบ จะเห็นได้ว่าในช่วงสี่ห้าปีที่ผ่านมาจะมีผลิตภัณฑ์ใหม่ ซึ่งมีคอมพิวเตอร์เข้าไปเกี่ยวข้องให้เห็นอยู่ตลอดเวลา
  เทคโนโลยี กับ สารสนเทศ เข้าด้วยกัน จึงหมายถึง เทคโนโลยีที่ใช้จัดการสารสนเทศเป็นเทคโนโลยีที่เกี่ยวข้องตั้งแต่การรวบรวมการจัดเก็บข้อมูล การประมวลผล การพิมพ์ การสร้างรายงาน การสื่อสารข้อมูล ฯลฯ เทคโนโลยีสารสนเทศจะรวมไปถึงเทคโนโลยีที่ทำให้เกิดระบบการให้บริการ การใช้ และการดูแลข้อมูล เทคโนโลยีสารสนเทศจึงมีความหมายที่กว้างขวางมาก นักเรียนจะได้พบกับสิ่งรอบ ๆ ตัวที่เกี่ยวกับการใช้สารสนเทศอยู่มาก ดังนี้
  การเก็บรวบรวมข้อมูล เป็นวิธีการรวบรวมข้อมูลเข้าสู่ระบบ นักเรียนอาจเห็นพนักงานการไฟฟ้าไปที่บ้านพร้อมเครื่องคอมพิวเตอร์ขนาดเล็กเพื่อบันทึกข้อมูลการใช้ไฟฟ้า ในการสอบแข่งขันที่มีผู้สอบจำนวนมาก ก็มีการใช้ดินสอระบายตามช่องที่เลือกตอบเพื่อให้เครื่องอ่านเก็บรวบรวมข้อมูลได้เมื่อไปซื้อสินค้าที่ห้างสรรพ สินค้าก็มีการใช้รหัสแท่ง (bar code) พนักงานจะนำสินค้าผ่านการตรวจของเครื่องเพื่ออ่านข้อมูลการซื้อสินค้าที่บรรจุในรหัสแท่ง เมื่อไปที่ห้องสมุดก็พบว่าหนังสือมีรหัสแท่งเช่นเดียวกันการใช้รหัสแท่งนี้เพื่อให้ง่ายต่อการเก็บรวบรวม
  การประมวลผล ข้อมูลที่เก็บมาได้มักจะเก็บในสื่อต่าง ๆ เช่น แผ่นบันทึก แผ่นซีดี หรือเทป เป็นต้น ข้อมูลเหล่านี้จะถูกนำมาประมวลผลตามต้องการ เช่น แยกแยะข้อมูลเป็นกลุ่ม เรียงลำดับข้อมูล คำนวณ หรือจัดการคัดแยกข้อมุลที่จัดเก็บนั้น
  การแสดงผลลัพธ์ อุปกรณ์ที่ใช้เทคโนโลยีในการแสดงผลลัพธ์มีมาก สามารถแสดงเป็นตัวหนังสือ เป็นรูปภาพ ตลอดจนพิมพ์ออกมาที่กระดาษ การแสดงผลลัพธ์มีทั้งที่แสดงเป็นภาพ เป็นเสียง เป็นวีดิทัศน์ เป็นต้น
  การทำสำเนา เมื่อมีข้อมูลที่จัดเก็บในสื่ออิเล็กทรอนิกส์ต่าง ๆ การทำสำเนาจะทำได้ง่าย และทำได้เป็นจำนวนมาก ดังนั้นอุปกรณ์ช่วยในการทำสำเนา จัดได้ว่าเป็นเทคโนโลยีสารสนเทศที่มีการพัฒนามาอย่างต่อเนื่อง เรามีเครื่องพิมพ์ เครื่องถ่ายเอกสาร อุปกรณ์การเก็บข้อมูลทางอิเล็กทรอนิกส์ เช่น จานบันทึก ซีดีรอม ซึ่งสามารถทำสำเนาได้เป็นจำนวนมาก
  <p align="justify" style="text-indent: 1in">การสื่อสารโทรคมนาคม เป็นวิธีการที่จะส่งจากที่หนึ่งไปยังอีกที่หนึ่ง หรือกระจายออกไปยังปลายทางครั้งละมาก ๆ ปัจจุบันมีอุปกรณ์ระบบสื่อสารโทรคมนาคมหลายประเภท ตั้งแต่โทรเลข โทรศัพท์ เส้นใยนำแสง เคเบิลใต้น้ำ คลื่นวิทยุไมโครเวฟ ดาวเทียม เป็นต้น
  <p align="justify" style="text-indent: 1in">1. สารสนเทศ (Information)
    สารสนเทศ หมายถึง ข้อมูลที่เป็นประโยชน์ต่อการดำเนินชีวิตของมนุษย์ หรืออาจกล่าวได้ว่า สารสนเทศ เกิดจากการนำข้อมูล ผ่านระบบการประมวลผล คำนวณ วิเคราะห์และแปลความหมายเป็นข้อความที่สามารถนำไปใช้ประโยชน์ได้ เช่น สารสนเทศที่เป็น ความรู้ที่เกิดจากวิทยุ โทรศัพท์มือถือ ข้อมูลข่าวสารต่าง ๆ รอบตัวเราซึ่งอาจมาจาก วิทยุ โทรทัศน์ เครือข่ายคอมพิวเตอร์ดาวเทียม โทรศัพท์ เครื่องจักร ที่เกี่ยวกับสารสนเทศได้ เครื่องคอมพิวเตอร์ ระบบสื่อสารโทรคมนาคมสมัยใหม่ เช่น การฝาก ถอนเงินผ่านเครื่อง ATM การจองตั๋วเครื่องบิน การลงทะเบียน ฯลฯ
  <p align="justify" style="text-indent: 1in">2. ระบบสารสนเทศ(Information  System)
  ระบบสารสนเทศ (Information System) คือ ขบวนการประมวลผลข่าวสารที่มีอยู่ ให้อยู่ในรูปของข่าวสารที่ เป็นประโยชน์สูง สุด เพื่อเป็นข้อสรุปที่ใช้สนับสนุนการตัดสินใจของบุคคลระดับบริหาร ขบวนการที่ทำให้เกิดข่าวสารสารสนเทศนี้ เรียกว่า การประมวลผลผลสารสนเทศ (Information Processing) และเรียกวิธีการประมวลผลสารสนเทศด้วยเครื่องมือทางอีเล็กทรอนิกส์ว่า เทคโนโลยีสารสนเทศ (Information Technology : IT)

	<p align="justify" style="text-indent: 1in">เทคโนโลยีสารสนเทศ หมายถึง เทคโนโลยีที่ประกอบขึ้นด้วยระบบจัดเก็บและประมวลผลข้อมูล ระบบสื่อสารโทรคมนาคม และอุปกรณ์สนับสนุนการปฏิบัติงานด้านสารสนเทศที่มีการวางแผน จัดการ และใช้ง่านร่วมกันอย่างมีประสิทธิภาพ
เทคโนโลยีสารสนเทศ มีองค์ประกอบสำคัญ 3 ประการ
 	<p align="justify" style="text-indent: 1in">1. ระบบประมวลผล
ความซับซ้อนในการปฏิบัติงานและความต้องการสารสนเทศที่หลากหลายทำให้การจัดการและการประมวลผลข้อมูลด้วยมือไม่สะดวกช้าและอาจผิดพลาดปัจจุบันองค์การจึงต้องทำการจัดเก็บและการประมวลผลข้อมูลด้วยระบบอีเล็กทรอนิกส์โดยใช้คอมพิวเตอร์และอุปกรณ์สนับสนุนในการจัดการข้อมูลเพื่อให้การทำงานถูกต้องและรวดเร็วขึ้น
 	<p align="justify" style="text-indent: 1in">2. ระบบสื่อสารโทรคมนาคม
 	การสื่อสารข้อมูลเป็นเรื่องสำคัญสำหรับการจัดการและประมวลผลตลอดจนการใช้ข้อมูลในการตัด สินใจระบบสารสนเทศที่ดีต้องประยุกต์เทคโนโลยีอีเล็กทรอนิกส์ในการสื่อสารข้อมูลระหว่างระบบคอมพิวเตอร์ อุปกรณ์อีเล็กทรอนิกส์ และผู้ใช้ที่อยู่ห่างกัน ให้สามารถสื่อสารกันได้อย่างมีประสิทธิภาพ
 	<p align="justify" style="text-indent: 1in">3. การจัดการข้อมูล
 	ปกติบุคคลที่ให้ความสนใจกับเทคโนโลยีจะอธิบายความหมายของเทคโนโลยีสารสนเทศโดยให้ความ สำคัญกับส่วนประกอบสองประการแรกแต่ผู้ที่สนใจด้านการจัดการข้อมูล(Data/Information Management) จะให้ความสำคัญกับส่วนประกอบที่สาม ซึ่งมีความเป็นศิลปะ ในการจัดรูปแบบและการใช้งานเทคโนโลยีสารสนเทศอย่างมีประสิทธิภาพ
 	สามารถสรุปได้ว่า เทคโนโลยีสารสนเทศเป็นเทคโนโลยีทุกรูปแบบที่นำมาประยุกต์ ในการประมวลผล การจัดเก็บ การสื่อสาร และการส่งผ่านสารสนเทศด้วยระบบอีเล็กทรอนิกส์ โดยที่ระบบทางกายภาพประกอบด้วยคอมพิวเตอร์ อุปกรณ์ติดต่อสื่อสาร และระบบเครือข่าย ขณะที่ระบบนามธรรมเกี่ยวข้องกับการจัดรูปแบบของการปฏิสัมพันธ์ด้านสารสนทศ ทั้งภายในและภายนอกระบบ ให้สามารถดำเนินร่วมกันอย่างประสิทธิภาพ (บุญธิดา สุขวิเศษ)
 	<p align="justify" style="text-indent: 1in">เครือข่ายคอมพิวเตอร์
 	การที่ระบบเครือข่ายมีบทบาทและความสำคัญเพิ่มขึ้นเพราะไมโครคอมพิวเตอร์ได้รับการใช้งานอย่างแพร่หลาย จึงเกิดความต้องการที่จะเชื่อมต่อคอมพิวเตอร์เหล่านั้นถึงกับเพื่อเพิ่มขีดความสามารถของระบบให้สูงขึ้น เพิ่มการใช้งานด้านต่าง ๆ และลดต้นทุนระบบโดยรวมลง มีการแบ่งใช้งานอุปกรณ์และข้อมูลต่าง ๆ ตลอดจนสามารถทำงานร่วมกันได้
 	สิ่งสำคัญที่ทำให้ระบบข้อมูลมีขีดความสามารถเพิ่มขึ้น คือ การโอนย้ายข้อมูลระหว่างกัน และการเชื่อมต่อหรือการสื่อสาร การโอนย้ายข้อมูลหมายถึงการนำข้อมูลมาแบ่งกันใช้งาน หรือการนำข้อมูลไปใช้ประมวลผลในลักษณะแบ่งกันใช้ทรัพยากร เช่น แบ่งกันใช้ซีพียู แบ่งกันใช้ฮาร์ดดิสก์ แบ่งกันใช้โปรแกรม และแบ่งกันใช้อุปกรณ์อื่น ๆ ที่มีราคาแพงหรือไม่สามารถจัดหาให้ทุกคนได้ การเชื่อมต่อคอมพิวเตอร์เป็นเครือข่ายจึงเป็นการเพิ่มประสิทธิภาพการใช้งานให้กว้างขวางและมากขึ้นจากเดิม
 	การเชื่อมต่อในความหมายของระบบเครือข่ายท้องถิ่นไม่ได้จำกัดอยู่ที่การเชื่อมต่อระหว่างเครื่องไมโครคอมพิวเตอร์ แต่ยังรวมไปถึงการเชื่อมต่ออุปกรณ์รอบข้าง เทคโนโลยีที่ก้าวหน้าทำให้การทำงานเฉพาะมีขอบเขตกว้างขวางยิ่งขึ้น มีการใช้เครื่องบริการแฟ้มข้อมูลเป็นที่เก็บรวบรวมแฟ้มข้อมูลต่างๆ มีการทำฐานข้อมูลกลาง มีหน่วยจัดการระบบสื่อสารหน่วยบริการใช้เครื่องพิมพ์ หน่วยบริการการใช้ซีดี หน่วยบริการปลายทาง และอุปกรณ์ประกอบสำหรับต่อเข้าในระบบเครือข่ายเพื่อจะทำงานเฉพาะเจาะจงอย่างใดอย่างหนึ่ง ในรูปเป็นตัวอย่างเครือข่ายคอมพิวเตอร์ที่จัดกลุ่มเชื่อมโยงเป็นระบบเครือข่ายคอมพิวเตอร์ก่อให้เกิดความ สามารถในการปฎิบัติการร่วมกันซึ่งหมายถึงการให้อุปกรณ์ทุกชิ้นที่ต่ออยู่บนเครือข่ายทำงานร่วมกันได้ทั้งหมดในลักษณะที่ประสานรวมกัน โดยผู้ใช้เห็นเสมือนใช้งานในอุปกรณ์เดียวกัน จึงเป็นวิธีการในการนำเอาอุปกรณ์ต่างชนิดจำนวนมาก มารวมกันเป็นเสมือนระบบเดียวกัน ทั้ง ๆ ที่อุปกรณ์เหล่านั้นอาจจะมาจากต่างยี่ห้อ ต่างบริษัท ก็ได้
 	ระบบเครือข่ายคอมพิวเตอร์ (Computer Network) หมายถึง การนำเครื่องคอมพิวเตอร์ มาเชื่อมต่อเข้าด้วยกันโดยอาศัยช่องทางการสื่อสารข้อมูล เพื่อแลกเปลี่ยนข้อมูลข่าวสารระหว่างเครื่องคอมพิวเตอร์ และการใช้ทรัพยากรของระบบร่วมกัน (Shared Resource) ในเครือข่ายนั้น  ระบบเครือข่ายคอมพิวเตอร์ มีองค์ประกอบที่สำคัญ เพื่อการเชื่อมต่อเป็นเครือข่ายคอมพิวเตอร์ ได้แก่ คอมพิวเตอร์แม่ข่าย (File Server) ช่องทางการสื่อสาร (Communication Chanel) สถานีงาน (Workstation or Terminal) และ อุปกรณ์ในเครือข่าย  (school.net,2014: website)</p>
</nav>

</ul>
</nav>
</div>

                  </label>
    </div>
              </form>
              </div>
            </div>
        </div>
        </div>
      </div>
    </body>
    </html>
    </p>

    <code><?= __FILE__ ?></code>
</div>
